In [8]:
import pandas as pd

In [4]:
#serier

In [10]:
s=pd.Series([ 12,34,56,73,23])

In [11]:
print(s)

0    12
1    34
2    56
3    73
4    23
dtype: int64

In [13]:
s=pd.Series([12,34,56,73,23,21.22])

In [14]:
s

0    12.00
1    34.00
2    56.00
3    73.00
4    23.00
5    21.22
dtype: float64

In [15]:
s.dtype

dtype('float64')

In [16]:
s.size

6

In [19]:
# Dataframe

In [20]:
roll=pd.Series([1,2,3,4,5])
name=pd.Series(['Karan','Aryan','Tejas','Tanvi','Anushka'])
marks=pd.Series([67,69,71,73,75])

In [21]:
df=pd.DataFrame({
    'roll':roll,
    'name': name,
    'marks': marks
})

In [22]:
df

   roll     name  marks
0     1    Karan     67
1     2    Aryan     69
2     3    Tejas     71
3     4    Tanvi     73
4     5  Anushka     75

In [23]:
df.shape

(5, 3)

In [24]:
df.size

15

In [25]:
df.columns

Index(['roll', 'name', 'marks'], dtype='object')

In [30]:
import os
os.getcwd()

'C:\\Users\\DELL'

In [2]:
import pandas as pd

In [27]:
# location:https://mitu.co.in/dataset
# doenload all the files starting from

In [3]:
df1=pd.read_csv('student1.csv')

In [5]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [6]:
df1=pd.read_csv('student1.csv')
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21